InformationRegisters/ОчередиСообщенийОбменаСИнтегрированнымиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОчередиСообщенийОбменаСИнтегрированнымиСистемами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОчередиСообщенийИнтегрированныхСистем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтегрированнаяСистема</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтегрированныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередиСообщенийОбменаСИнтегрированнымиСистемами/Ext/ManagerModule.bsl
// Помещает указанное сообщение в очередь для указанной интегрированной системы
//
Процедура ПоместитьСообщениеВОчередь(ИнтегрированнаяСистема, Сообщение) Экспорт
	
	МенеджерЗаписиОчередей = РегистрыСведений.ОчередиСообщенийОбменаСИнтегрированнымиСистемами.СоздатьМенеджерЗаписи();
	МенеджерЗаписиОчередей.ИнтегрированнаяСистема = ИнтегрированнаяСистема;
	МенеджерЗаписиОчередей.Прочитать();
	
	Если МенеджерЗаписиОчередей.Выбран() Тогда
		Сообщение.Очередь = МенеджерЗаписиОчередей.Очередь;
	Иначе		
		// Если очереди для этой интегрированной системы еще нет, то она создается
		МенеджерЗаписиОчередей.ИнтегрированнаяСистема = ИнтегрированнаяСистема;
		
		НоваяОчередь = Справочники.ОчередиСообщенийИнтегрированныхСистем.СоздатьЭлемент();
		НоваяОчередь.Наименование = 
				Строка(МенеджерЗаписиОчередей.ИнтегрированнаяСистема);
		НоваяОчередь.Записать();
		
		МенеджерЗаписиОчередей.Очередь = НоваяОчередь.Ссылка;
		МенеджерЗаписиОчередей.Записать();
		
		Сообщение.Очередь = НоваяОчередь.Ссылка;
	КонецЕсли;
	
	Сообщение.Записать();
	
КонецПроцедуры

// Получает количество сообщений в очереди для указанной интегрированной системы
//
Функция ПолучитьКоличествоСообщенийВОчереди(ИнтегрированнаяСистема) Экспорт
	                                                                                  
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СообщенияИнтегрированныхСистем.Ссылка) КАК Колво
		|ИЗ
		|	Справочник.СообщенияИнтегрированныхСистем КАК СообщенияИнтегрированныхСистем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОчередиСообщенийОбменаСИнтегрированнымиСистемами КАК ОчередиСообщенийОбменаСИнтегрированнымиСистемами
		|		ПО СообщенияИнтегрированныхСистем.Очередь = ОчередиСообщенийОбменаСИнтегрированнымиСистемами.Очередь
		|ГДЕ
		|	ОчередиСообщенийОбменаСИнтегрированнымиСистемами.ИнтегрированнаяСистема = &ИнтегрированнаяСистема
		|	И СообщенияИнтегрированныхСистем.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИнтегрированнаяСистема", ИнтегрированнаяСистема);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Колво;
	Иначе
		Возврат 0;
	КонецЕсли;
			
КонецФункции
